# GetAssociatedRailings Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Stairs..::..GetAssociatedRailings Method
Stairs Class See Also
---
Gets a list of the Railing elements which are associated to the boundaries of the stairs.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ICollection<ElementId> GetAssociatedRailings()
```

Visual Basic
---
```text
Public Function GetAssociatedRailings As ICollection(Of ElementId)
```

Visual C++
---
```text
public:
ICollection<ElementId^>^ GetAssociatedRailings()
```

# ### Return Value
The ids of the Railing elements.
# Remarks
This does not return railings which are sketched directly to the stairs (and are not associated to boundaries).
# See Also
Stairs Class
Autodesk.Revit.DB.Architecture Namespace